Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/concurrent-mode-patterns_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: --- id: concurrent-mode-patterns title: Concurrent UI Patterns (Experimental) permalink: docs/concurrent-mode-patterns.html prev: concurrent-mode-suspense.html next: concurrent-mode-adoption.html ---
ja: --- id: concurrent-mode-patterns title: 並列的 UI パターン（実験的機能） permalink: docs/concurrent-mode-patterns.html prev: concurrent-mode-suspense.html next: concurrent-mode-adoption.html ---

source: >Caution: > >This page was about experimental features that aren't yet available in a stable release. It was aimed at early adopters and people who are curious.
ja: >警告: > > このページはアーリーアダプターや興味のある読者を対象に、安定リリースでまだ利用できない実験的機能を説明するために存在していました。

source: > >Much of the information on this page is now outdated and exists only for archival purposes.
ja: > > このページの説明のほとんどは既に古くなっており、アーカイブの目的のためだけに残しています。

source: **Please refer to the [React 18 Alpha announcement post](/blog/2021/06/08/the-plan-for-react-18.html ) for the up-to-date information.**
ja: 最新の情報については [React 18 アルファのアナウンス](/blog/2021/06/08/the-plan-for-react-18.html)を参照してください。

source: > >Before React 18 is released, we will replace this page with stable documentation.
ja: > > React 18 のリリースまでに、このページはより安定したドキュメントに置き換わる予定です。

source: Usually, when we update the state, we expect to see changes on the screen immediately.
ja: 通常、state を更新した場合、画面に即座に変化が現れることを期待します。

source: This makes sense because we want to keep our app responsive to user input.
ja: ユーザ入力に対してアプリケーションをレスポンシブに保ちたいので、これは理にかなっています。

source: However, there are cases where we might prefer to **defer an update from appearing on the screen**.
ja: しかし、**画面に更新が現れるのを遅延**させたい場合があります。

source: For example, if we switch from one page to another, and none of the code or data for the next screen has loaded yet, it might be frustrating to immediately see a blank page with a loading indicator.
ja: 例えば、ある画面から別の画面に切り替えたいが、次の画面に必要なコードやデータが何もロードされていないという場合、切り替え直後に、ロード中インジケータだけがある空のページを見せられるのは煩わしいものです。

source: We might prefer to stay longer on the previous screen.
ja: 前の画面にもうしばらく残りたいと思うでしょう。

source: Implementing this pattern has historically been difficult in React.
ja: 歴史的に React ではこのパターンの実装は困難でした。

source: Concurrent Mode offers a new set of tools to do that.
ja: 並列モードはこれを行うための新たなツール群を提供します。

source: - [Transitions](#transitions)
ja: - [トランジション](#transitions)

source: - [Wrapping setState in a Transition](#wrapping-setstate-in-a-transition)
ja: - [トランジション内で setState をラップする](#wrapping-setstate-in-a-transition)

source: - [Adding a Pending Indicator](#adding-a-pending-indicator)
ja: - [Pending インジケータの追加](#adding-a-pending-indicator)

source: - [Reviewing the Changes](#reviewing-the-changes)
ja: - [変更のおさらい](#reviewing-the-changes)

source: - [Where Does the Update Happen?](#where-does-the-update-happen)
ja: - [更新はどこで起こるのか？](#where-does-the-update-happen)

source: - [Transitions Are Everywhere](#transitions-are-everywhere)
ja: - [トランジションは至る所にある](#transitions-are-everywhere)

source: - [Baking Transitions Into the Design System](#baking-transitions-into-the-design-system) - [The Three Steps](#the-three-steps)
ja: - [トランジションをデザインシステムに組み込む](#baking-transitions-into-the-design-system) - [3 つのステップ](#the-three-steps)

source: - [Default: Receded → Skeleton → Complete](#default-receded-skeleton-complete)
ja: - [デフォルト：Receded → Skeleton → Complete](#default-receded-skeleton-complete)

source: - [Preferred: Pending → Skeleton → Complete](#preferred-pending-skeleton-complete)
ja: - [推奨：Pending → Skeleton → Complete](#preferred-pending-skeleton-complete)

source: - [Wrap Lazy Features in `<Suspense>`](#wrap-lazy-features-in-suspense)
ja: - [遅延可能な機能を `<Suspense>` でラップする](#wrap-lazy-features-in-suspense)

source: - [Suspense Reveal “Train”](#suspense-reveal-train)
ja: - [「電車」式のサスペンス開放](#suspense-reveal-train)

source: - [Delaying a Pending Indicator](#delaying-a-pending-indicator)
ja: - [Pending インジケータの遅延](#delaying-a-pending-indicator)

source: - [Recap](#recap) - [Other Patterns](#other-patterns)
ja: - [まとめ](#recap) - [他のパターン](#other-patterns)

source: - [Splitting High and Low Priority State](#splitting-high-and-low-priority-state)
ja: - [高優先度 state と低優先度 state の分割](#splitting-high-and-low-priority-state)

source: - [Deferring a Value](#deferring-a-value)
ja: - [値の遅延](#deferring-a-value)

source: - [SuspenseList](#suspenselist) - [Next Steps](#next-steps)
ja: - [SuspenseList](#suspenselist) - [次のステップ](#next-steps)

source: ## Transitions {#transitions}
ja: ## トランジション {#transitions}

source: Let's revisit [this demo](https://codesandbox.io/s/infallible-feather-xjtbu) from the previous page about [Suspense for Data Fetching](/docs/concurrent-mode-suspense.html).
ja: 前のページ、[サスペンスを使ったデータ取得](/docs/concurrent-mode-suspense.html)にある[こちらのデモ](https://codesandbox.io/s/infallible-feather-xjtbu)について改めて考えましょう。

source: When we click the "Next" button to switch the active profile, the existing page data immediately disappears, and we see the loading indicator for the whole page again.
ja: "Next" ボタンをクリックしてアクティブなプロフィールを切り替えた際、既存のページデータは即座に消えて、新しい画面のためのローディングインジケータを見ることになります。

source: We can call this an "undesirable" loading state.
ja: これは「望ましくない」ローディング中状態と呼べるでしょう。

source: **It would be nice if we could "skip" it and wait for some content to load before transitioning to the new screen.**
ja: **これをスキップして、新しい画面に遷移 (transition) する前に新しいコンテンツがロードされるのを待機できれば良さそうです。**

source: React offers a new built-in `useTransition()` Hook to help with this.
ja: React はこれを補助するために `useTransition()` という新しい組み込みフックを提供します。

source: We can use it in three steps.
ja: これは以下の 3 ステップで利用できます。

source: First, we'll make sure that we're actually using Concurrent Mode.
ja: まず、実際に並列モードを利用していることを確かめます。

source: We'll talk more about [adopting Concurrent Mode](/docs/concurrent-mode-adoption.html) later, but for now it's sufficient to know that we need to use `ReactDOM.createRoot()` rather than `ReactDOM.render()` for this feature to work:
ja: 後で[並列モードの利用開始](/docs/concurrent-mode-adoption.html)方法については述べますが、今のところは `ReactDOM.render()` の代わりに `ReactDOM.createRoot()` を使うことでこの機能が使える、ということを知っていれば十分です。

source: Next, we'll add an import for the `useTransition` Hook from React:
ja: 次に、React から `useTransition` フックをインポートする文を追加します：

source: Finally, we'll use it inside the `App` component:
ja: 最後に、`App` コンポーネント内でそれを利用します：

source: **By itself, this code doesn't do anything yet.** We will need to use this Hook's return values to set up our state transition.
ja: **このコードはそれ自体ではまだ何もしません。**このフックの戻り値を使って state のトランジションをセットアップします。

source: There are two values returned from `useTransition`:
ja: `useTransition` からの戻り値は 2 つです：

source: * `startTransition` is a function.
ja: * `startTransition` は関数です。

source: We'll use it to tell React *which* state update we want to defer.
ja: これを使って、*どの* state の更新を遅延させたいのかを React に伝えます。

source: * `isPending` is a boolean.
ja: * `isPending` は真偽値です。

source: It's React telling us whether that transition is ongoing at the moment.
ja: React はこれを使って現在トランジションが進行中かどうかを伝えます。

source: We will use them right below.
ja: このすぐ後で使ってみます。

source: Note we passed a configuration object to `useTransition`.
ja: `useTransition` に設定オブジェクトを渡したことに気をつけてください。

source: Its `timeoutMs` property specifies **how long we're willing to wait for the transition to finish**.
ja: この `timeoutMs` プロパティで**トランジションが終了するまでどれだけ待てるか**を指定します。

source: By passing `{timeoutMs: 3000}`, we say "If the next profile takes more than 3 seconds to load, show the big spinner -- but before that timeout it's okay to keep showing the previous screen".
ja: `{timeoutMs: 3000}` を渡すことで、「次のプロフィール画面がロードされるのに 3 秒以上かかったら、大きなスピナーを表示せよ、ただしそれまでは前の画面を表示しつづけていて構わない」ということを伝えています。

source: ### Wrapping setState in a Transition {#wrapping-setstate-in-a-transition}
ja: ### トランジション内で setState をラップする {#wrapping-setstate-in-a-transition}

source: Our "Next" button click handler sets the state that switches the current profile in the state:
ja: "Next" ボタンのクリックハンドラは、現在のプロフィールを切り替えるための state を設定しています：

source: We'll wrap that state update into `startTransition`.
ja: この state の更新を `startTransition` でラップします。

source: That's how we tell React **we don't mind React delaying that state update** if it leads to an undesirable loading state:
ja: これが、もしこの state の更新によって望ましくないローディング中状態の表示が起きる場合、**React がこの state 更新を遅延させても構わない**、と React に伝える方法です：

source: **[Try it on CodeSandbox](https://codesandbox.io/s/musing-driscoll-6nkie)**
ja: **[CodeSandbox で試す](https://codesandbox.io/s/musing-driscoll-6nkie)**

source: Press "Next" a few times.
ja: 何度か "Next" を押してみましょう。

source: Notice it already feels very different.
ja: 既に大きく違っていることが分かるでしょう。

source: **Instead of immediately seeing an empty screen on click, we now keep seeing the previous page for a while.** When the data has loaded, React transitions us to the new screen.
ja: **クリック直後に空の画面を見せられる代わりに、しばらくは前のページが表示され続けます。**データがロードされたら、React が次の画面に遷移します。

source: If we make our API responses take 5 seconds, [we can confirm](https://codesandbox.io/s/relaxed-greider-suewh) that now React "gives up" and transitions anyway to the next screen after 3 seconds.
ja: もし API のレスポンスを 5 秒かかるように変えると、React は 3 秒後に「諦めて」、ともかく画面の遷移を行うことが[確認できます](https://codesandbox.io/s/relaxed-greider-suewh)。

source: This is because we passed `{timeoutMs: 3000}` to `useTransition()`.
ja: これは `useTransition()` に `{timeoutMs: 3000}` を渡したからです。

source: For example, if we passed `{timeoutMs: 60000}` instead, it would wait a whole minute.
ja: もし `{timeoutMs: 60000}` を代わりに渡したら、丸々 1 分間待つことになるでしょう。

source: ### Adding a Pending Indicator {#adding-a-pending-indicator}
ja: ### Pending インジケータの追加 {#adding-a-pending-indicator}

source: There's still something that feels broken about [our last example](https://codesandbox.io/s/musing-driscoll-6nkie).
ja: [前回の例](https://codesandbox.io/s/musing-driscoll-6nkie)にはまだうまく行っていないところがあります。

source: Sure, it's nice not to see a "bad" loading state.
ja: 「望ましくない」ローディング中状態は、もちろん見えない方がいいです。

source: **But having no indication of progress at all feels even worse!** When we click "Next", nothing happens and it feels like the app is broken.
ja: **ですが進行状況が一切見えないのはもっとダメに感じられます！** "Next" をクリックして何も起こらなかったなら、アプリケーションが壊れているように思うでしょう。

source: Our `useTransition()` call returns two values: `startTransition` and `isPending`.
ja: `useTransition()` の呼び出しは、2 つの値を返します。`startTransition` と `isPending` です。

source: We've already used `startTransition` to wrap the state update.
ja: `startTransition` はもう使っています。

source: Now we're going to use `isPending` too.
ja: ここで `isPending` も使うようにします。

source: React gives this boolean to us so we can tell whether **we're currently waiting for this transition to finish**.
ja: React がこの真偽値を渡してくれることで、**このトランジションの完了を待っているところかどうか**が分かります。

source: We'll use it to indicate that something is happening:
ja: 何かが起こっている、ということを示すためにこれを使いましょう：

source: **[Try it on CodeSandbox](https://codesandbox.io/s/jovial-lalande-26yep)**
ja: **[CodeSandbox で試す](https://codesandbox.io/s/jovial-lalande-26yep)**

source: Now, this feels a lot better!
ja: ずっと良く感じられるようになりました！

source: When we click Next, it gets disabled because clicking it multiple times doesn't make sense.
ja: "Next" をクリックすると、何度も押しても意味がないのでボタンは無効化されます。

source: And the new "Loading..." tells the user that the app didn't freeze.
ja: そして新たに表示される "Loading..." が、ユーザにアプリケーションがフリーズしていないということを伝えています。

source: ### Reviewing the Changes {#reviewing-the-changes}
ja: ### 変更のおさらい {#reviewing-the-changes}

source: Let's take another look at all the changes we've made since the [original example](https://codesandbox.io/s/infallible-feather-xjtbu):
ja: [元の例](https://codesandbox.io/s/infallible-feather-xjtbu)以降に行った変更をもう一度すべて見てみましょう：

source: It took us only seven lines of code to add this transition:
ja: このトランジションを加えるのに必要だったコードはわずか 7 行でした。

source: * We've imported the `useTransition` Hook and used it in the component that updates the state.
ja: * `useTransition` フックをインポートして、state を更新するコンポーネント内で使いました。

source: * We've passed `{timeoutMs: 3000}` to stay on the previous screen for at most 3 seconds.
ja: * `{timeoutMs: 3000}` を渡すことで、最高 3 秒間は前の画面に留まるようにしました。

source: * We've wrapped our state update into `startTransition` to tell React it's okay to delay it.
ja: * state の更新を `startTransition` でラップし、この更新は遅延可能であると伝えました。

source: * We're using `isPending` to communicate the state transition progress to the user and to disable the button.
ja: * `isPending` を使って、ユーザにトランジションの進行状況を伝えるとともに、ボタンを無効化しました。

source: As a result, clicking "Next" doesn't perform an immediate state transition to an "undesirable" loading state, but instead stays on the previous screen and communicates progress there.
ja: 結果として、"Next" をクリックしても「望ましくない」ローディング中状態に直接遷移するのではなく、前の画面に留まってユーザに進行状況を伝えるようになりました。

source: ### Where Does the Update Happen?
ja: ### 更新はどこで起こるのか？

source: This wasn't very difficult to implement.
ja: これを実装するのはあまり難しくありませんでした。

source: However, if you start thinking about how this could possibly work, it might become a little mindbending.
ja: しかしこれがどうやって動作しているのかを考え始めると、ちょっと混乱しそうになります。

source: If we set the state, how come we don't see the result right away?
ja: state を設定したのに、なぜその結果がすぐ現れなかったのでしょうか。

source: *Where* is the next `<ProfilePage>` rendering?
ja: 次の `<ProfilePage>` は*どこで*レンダーされているのでしょうか？

source: Clearly, both "versions" of `<ProfilePage>` exist at the same time.
ja: 明らかに、`<ProfilePage>` の両方の「バージョン」が同時に存在しているのです。

source: We know the old one exists because we see it on the screen and even display a progress indicator on it.
ja: 古いバージョンが存在していることは、画面に表示されており進行中のインジケータまで表示しているということから分かります。

source: And we know the new version also exists *somewhere*, because it's the one that we're waiting for!
ja: また新しいバージョンが*どこかに*存在しているということも分かります。まさにそれが完了するのを待っているのですから！

source: **But how can two versions of the same component exist at the same time?**
ja: **ですが、同じコンポーネントの 2 つのバージョンがどうやって同時に存在できるのでしょうか？**

source: This gets at the root of what Concurrent Mode is.
ja: これが並列モードの根幹にあたる部分です。

source: We've [previously said](/docs/concurrent-mode-intro.html#intentional-loading-sequences) it's a bit like React working on state update on a "branch".
ja: これは React が state の更新を「ブランチ」で行っているようなものであると[以前述べました](/docs/concurrent-mode-intro.html#intentional-loading-sequences)。

source: Another way we can conceptualize is that wrapping a state update in `startTransition` begins rendering it *"in a different universe"*, much like in science fiction movies.
ja: これを概念化する別の方法として、`startTransition` で state の更新をラップすることで、SF 映画のごとくレンダーが*「別の宇宙で」*始まるのだと考えることができます。

source: We don't "see" that universe directly -- but we can get a signal from it that tells us something is happening (`isPending`).
ja: その宇宙を直接「見る」ことはできません -- しかしその宇宙からは何かが起きているという信号 (`isPending`) を得ることはできます。

source: When the update is ready, our "universes" merge back together, and we see the result on the screen!
ja: 更新の準備が完了したところで、「2 つの宇宙」がマージされ、画面に結果が表示されます！

source: Play a bit more with the [demo](https://codesandbox.io/s/jovial-lalande-26yep), and try to imagine it happening.
ja: [デモ](https://codesandbox.io/s/jovial-lalande-26yep)で遊んでみて、そのようなことが起きているところを想像してみてください。

source: Of course, two versions of the tree rendering *at the same time* is an illusion, just like the idea that all programs run on your computer at the same time is an illusion.
ja: もちろん、ツリーの 2 つのバージョンが*同時に*レンダーされているというのは錯覚であり、それはあなたのコンピュータ上のプログラムが全部同時に実行されていると考えることが錯覚であるのと同じです。

source: An operating system switches between different applications very fast.
ja: オペレーティング・システムは複数のアプリケーションを非常に素早く切り替えているのです。

source: Similarly, React can switch between the version of the tree you see on the screen and the version that it's "preparing" to show next.
ja: 同様に React は、画面上に見えているツリーのバージョンと、次に表示されるために「準備中」のバージョンとを切り替えています。

source: An API like `useTransition` lets you focus on the desired user experience, and not think about the mechanics of how it's implemented.
ja: `useTransition` のような API を使うことで、望ましいユーザ体験に集中でき、それがどのような仕組みで実現されているのかについて気にしないでよくなります。

source: Still, it can be a helpful metaphor to imagine that updates wrapped in `startTransition` happen "on a branch" or "in a different world".
ja: それでも、`startTransition` でラップした更新が「ブランチ」や「別世界」で起こっていると想像するのは例え話としては有用です。

source: ### Transitions Are Everywhere {#transitions-are-everywhere}
ja: ### トランジションは至る所にある {#transitions-are-everywhere}

source: As we learned from the [Suspense walkthrough](/docs/concurrent-mode-suspense.html), any component can "suspend" any time if some data it needs is not ready yet.
ja: [サスペンスの解説](/docs/concurrent-mode-suspense.html)で学んだ通り、コンポーネントはそれが必要とするデータがまだ準備できていない場合にいつでも「サスペンド」することができます。

source: We can strategically place `<Suspense>` boundaries in different parts of the tree to handle this, but it won't always be enough.
ja: 計画的にツリー内の様々な場所に `<Suspense>` バウンダリを配置することでこれを制御できますが、それでは十分でないことがあります。

source: Let's get back to our [first Suspense demo](https://codesandbox.io/s/frosty-hermann-bztrp) where there was just one profile.
ja: プロフィールが 1 つだけだった最初の[サスペンスのデモ](https://codesandbox.io/s/frosty-hermann-bztrp)に戻りましょう。

source: Currently, it fetches the data only once.
ja: 今のところはデータを 1 回だけ取得しています。

source: We'll add a "Refresh" button to check for server updates.
ja: サーバ側に更新があるかを確認する "Refresh" ボタンを追加しましょう。

source: Our first attempt might look like this:
ja: まずはこのようにしてみました：

source: **[Try it on CodeSandbox](https://codesandbox.io/s/boring-shadow-100tf)**
ja: **[CodeSandbox で試す](https://codesandbox.io/s/boring-shadow-100tf)**

source: In this example, we start data fetching at the load *and* every time you press "Refresh".
ja: この例では、ロード時**および** "Refresh" を押下する度に、データ取得が開始されます。

source: We put the result of calling `fetchUserAndPosts()` into state so that components below can start reading the new data from the request we just kicked off.
ja: `fetchUserAndPosts()` を呼び出した結果を state 内に入れることで、配下のコンポーネントがたった今開始したリクエストから新しいデータを読み出せるようにします。

source: We can see in [this example](https://codesandbox.io/s/boring-shadow-100tf) that pressing "Refresh" works.
ja: [こちら](https://codesandbox.io/s/boring-shadow-100tf)で試せるとおり、"Refresh" ボタンの押下は動作はしています。

source: The `<ProfileDetails>` and `<ProfileTimeline>` components receive a new `resource` prop that represents the fresh data, they "suspend" because we don't have a response yet, and we see the fallbacks.
ja: `<ProfileDetails>` と `<ProfileTimeline>` コンポーネントは新しいデータを表す `resource` を props として受け取り、レスポンスがまだ存在しないため「サスペンド」し、フォールバックが表示されます。

source: When the response loads, we can see the updated posts (our fake API adds them every 3 seconds).
ja: レスポンスがロードされると、更新されたタイムライン投稿を見ることができます（フェイク API は 3 秒ごとに投稿を追加するようになっています）。

source: However, the experience feels really jarring.
ja: しかしながらユーザ体験はとても煩わしいものとなっています。

source: We were browsing a page, but it got replaced by a loading state right as we were interacting with it.
ja: ページをブラウズしているのに、操作の真っ最中にページがローディング中状態で置き換わってしまうのです。

source: It's disorienting.
ja: これはユーザを混乱させます。

source: **Just like before, to avoid showing an undesirable loading state, we can wrap the state update in a transition:**
ja: **これまでと同様に、望ましくないローディング中状態を回避するために、state の更新をトランジションでラップできます：**

source: **[Try it on CodeSandbox](https://codesandbox.io/s/sleepy-field-mohzb)**
ja: **[CodeSandbox で試す](https://codesandbox.io/s/sleepy-field-mohzb)**

source: This feels a lot better!
ja: ずっと良く感じられます！

source: Clicking "Refresh" doesn't pull us away from the page we're browsing anymore.
ja: "Refresh" をクリックすることで今ブラウズしていたページから引き離されることがなくなりました。

source: We see something is loading "inline", and when the data is ready, it's displayed.
ja: 何かがロード中であると「インライン」で見ることができ、データの準備が完了したらそれが表示されます。

source: ### Baking Transitions Into the Design System {#baking-transitions-into-the-design-system}
ja: ### トランジションをデザインシステムに組み込む {#baking-transitions-into-the-design-system}

source: We can now see that the need for `useTransition` is *very* common.
ja: これで `useTransition` の要求は*非常に*よくあるものであることが分かったでしょう。

source: Pretty much any button click or interaction that can lead to a component suspending needs to be wrapped in `useTransition` to avoid accidentally hiding something the user is interacting with.
ja: コンポーネントのサスペンドを引き起こすような、ほぼあらゆるボタンクリックやユーザ操作は、`useTransition` でラップして、ユーザが触っていたものをうっかり隠さないようにする必要があります。

source: This can lead to a lot of repetitive code across components.
ja: これはコンポーネント間で多くのコードの反復を引き起こす可能性があります。

source: This is why **we generally recommend to bake `useTransition` into the *design system* components of your app**.
ja: このため、**`useTransition` を*デザインシステム*コンポーネントに組み込む**ことをお勧めします。

source: For example, we can extract the transition logic into our own `<Button>` component:
ja: 例えば、トランジションのロジックを独自の `<Button>` コンポーネントに抽出することができます。

source: **[Try it on CodeSandbox](https://codesandbox.io/s/modest-ritchie-iufrh)**
ja: **[CodeSandbox で試す](https://codesandbox.io/s/modest-ritchie-iufrh)**

source: Note that the button doesn't care *what* state we're updating.
ja: このボタンは*何の* state を更新しようとしているのか関知しないということに注意してください。

source: It's wrapping *any* state updates that happen during its `onClick` handler into a transition.
ja: これは `onClick` ハンドラ内部で起こる*あらゆる* state の更新をトランジションでラップしています。

source: Now that our `<Button>` takes care of setting up the transition, the `<ProfilePage>` component doesn't need to set up its own:
ja: これで `<Button>` がトランジションの作成を行ってくれるようになったので、`<ProfilePage>` コンポーネントがそれを自ら作成する必要がなくなりました：

source: When a button gets clicked, it starts a transition and calls `props.onClick()` inside of it -- which triggers `handleRefreshClick` in the `<ProfilePage>` component.
ja: ボタンがクリックされると、トランジションが開始され、内部の `props.onClick()` が呼び出されます。それが `<ProfilePage>` コンポーネント内の `handleRefreshClick` をトリガします。

source: We start fetching the fresh data, but it doesn't trigger a fallback because we're inside a transition, and the 10 second timeout specified in the `useTransition` call hasn't passed yet.
ja: 新しいデータの取得が開始されますが、トランジションの内部におり、かつ `useTransition` 呼び出しで指定されている 10 秒のタイムアウトがまだ経過していないため、フォールバックは呼び出されません。

source: While a transition is pending, the button displays an inline loading indicator.
ja: トランジションが進行している間、ボタンはインラインでローディングインジケータを表示します。

source: We can see now how Concurrent Mode helps us achieve a good user experience without sacrificing isolation and modularity of components.
ja: これで、コンポーネントの独立性やモジュール性を犠牲にすることなく良いユーザ体験を実現するのに、並列モードがどのように役立つのかが分かったと思います。

source: React coordinates the transition.
ja: React がトランジションの調整を行うのです。

source: ## The Three Steps {#the-three-steps}
ja: ## 3 つのステップ {#the-three-steps}

source: By now we have discussed all of the different visual states that an update may go through.
ja: ここまでで、更新があったときに経由する可能性のある視覚的な状態についてすべて説明しました。

source: In this section, we will give them names and talk about the progression between them.
ja: このセクションでは、それらに名前を付け、それらの間での連続性について説明します。

source: At the very end, we have the **Complete** state.
ja: 最後に存在しているのは **Complete** 状態です。

source: That's where we want to eventually get to.
ja: ここが最終的に到達したい状態です。

source: It represents the moment when the next screen is fully rendered and isn't loading more data.
ja: 次画面が完全に描画されており、それ以上データを読み込んでいないタイミングを表しています。

source: But before our screen can be Complete, we might need to load some data or code.
ja: しかし画面が Complete になる前に、何らかのデータやコードを読み込む必要があります。

source: When we're on the next screen, but some parts of it are still loading, we call that a **Skeleton** state.
ja: 次画面を表示はしているが、その中の一部がまだロード中である場合、それを **Skeleton** 状態と呼びます。

source: Finally, there are two primary ways that lead us to the Skeleton state.
ja: 最後に、Skeleton 状態に至るまでの経路が主に 2 つあります。

source: We will illustrate the difference between them with a concrete example.
ja: 具体的な例を使ってそれらの違いを述べたいと思います。

source: ### Default: Receded → Skeleton → Complete {#default-receded-skeleton-complete}
ja: ### デフォルト：Receded → Skeleton → Complete {#default-receded-skeleton-complete}

source: Open [this example](https://codesandbox.io/s/prod-grass-g1lh5) and click "Open Profile".
ja: [こちらの例](https://codesandbox.io/s/prod-grass-g1lh5)を開いて "Open Profile" をクリックしてください。
